
maple_class = {
    '모험가' : {
        '전사' : ['히어로', '다크나이트', '팔라딘'],
        '마법사' : ['비숍', '썬콜', '불독'],
        '궁수' : ['신궁', '보우마스터', '패스파인더'],
        '도적' : ['나이트로드', '섀도어', '듀얼블레이드'],
        '해적' : ['캡틴', '바이퍼', '캐논슈터']
    },
    '시그너스' : {
        '전사' : ['미하일', '소울마스터'],
        '마법사' : ['플레임위자드'],
        '궁수' : ['윈드브레이커'],
        '도적' : ['나이트워커'], 
        '해적' : ['스트라이커']
    },
    '레지스탕스' : {
        '전사' : ['데몬슬레이어', '데몬어벤져', '블래스터'],
        '마법사' : ['배틀메이지'], 
        '궁수' : ['와일드헌터'], 
        '도적' : ['제논'],
        '해적' : ['메카닉']
    },
    '영웅' : {
        '전사' : ['아란'], 
        '마법사' : ['에반', '루미너스'], 
        '궁수' : ['메르세데스'], 
        '도적' : ['팬텀'], 
        '해적' : ['은월']
    },
    '노바' : {
        '전사' : ['카이저'],
        '마법사' : [],
        '궁수' : ['카인'],
        '도적' : ['카데나'],
        '해적' : ['엔젤릭버스터']
    },
    '레프' : {
        '전사' : ['아델'],
        '마법사' : ['일리움'],
        '궁수' : [],
        '도적' : ['칼리'],
        '해적' : ['해적']
    },
    '아니마' : {
        '전사' : [],
        '마법사' : ['라라'],
        '궁수' : [],
        '도적' : ['호영'],
        '해적' : []
    },
    '제로' :'제로',
    '키네시스' : '키네시스'
}
